package mentor.mentor1;

public class main {
    public static void main(String[] args) {
        for (education item : education.values()) {
            System.out.println(item);
        }

    }
}
// создать колледж, университет и школы -с помощью перечисления.
// Вывести их в последовательности обучения используя ordinals
